## Dataframes

#### Semelhante ao Excel - tabelas

In [4]:
import numpy as np
import pandas as pd

In [5]:
from numpy.random import randn
np.random.seed(101)

In [8]:
df = pd.DataFrame(randn(5, 4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())

In [9]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

#### Seleção e Indexação

In [10]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [13]:
df[['W', 'Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [14]:
df.X

A    1.693723
B    0.390528
C    0.072960
D   -0.754070
E    1.901755
Name: X, dtype: float64

In [15]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [16]:
df['Novo'] = df['W'] - df['X']

In [17]:
df

          W         X         Y         Z      Novo
A  0.302665  1.693723 -1.706086 -1.159119 -1.391057
B -0.134841  0.390528  0.166905  0.184502 -0.525369
C  0.807706  0.072960  0.638787  0.329646  0.734746
D -0.497104 -0.754070 -0.943406  0.484752  0.256966
E -0.116773  1.901755  0.238127  1.996652 -2.018528

In [18]:
df.drop('Novo', axis = 1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [19]:
df

          W         X         Y         Z      Novo
A  0.302665  1.693723 -1.706086 -1.159119 -1.391057
B -0.134841  0.390528  0.166905  0.184502 -0.525369
C  0.807706  0.072960  0.638787  0.329646  0.734746
D -0.497104 -0.754070 -0.943406  0.484752  0.256966
E -0.116773  1.901755  0.238127  1.996652 -2.018528

In [20]:
df.drop('Novo', axis = 1, inplace= True)

In [21]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [22]:
df.drop('C', axis = 0)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [24]:
df.loc['B']

W   -0.134841
X    0.390528
Y    0.166905
Z    0.184502
Name: B, dtype: float64

In [25]:
df.iloc[2]

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [26]:
df.loc['D', 'X']

-0.7540697010400628

In [27]:
df.loc[['A', 'B', 'C'], ['X', 'Y']]

          X         Y
A  1.693723 -1.706086
B  0.390528  0.166905
C  0.072960  0.638787

#### Seleção condicional

In [28]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [29]:
df > 0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [30]:
df[df > 0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [32]:
df[df['X'] > 0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
E -0.116773  1.901755  0.238127  1.996652

In [36]:
df[(df['W'] > 0) & (df['Z'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []